#13) შექმენით ცვლადი რომელშიც შეინახავთ თქვენთვის სასურველ string-ს, უნდა იყოს მინიმუმ 20 სიმბოლო, შემდეგ slicing-ის საშვალებით დაბეჭდეთ ეს string ხუთგვარად შემდეგი პირობებით:

# მხოლოდ პირველი 5 სიმბოლო
# ბოლო 4 სიმბოლო
# შუა ნაწილი მეოთხე სიმბოლოდან მეათემდე
# მთელი სტრინგი შებრუნებულად
# სტრინგი ამოჭრილი ყოველ მეორე სიმბოლოზე
now_im_too_tired = "bumbushela cxvari mi"
#skami              12345678901234567890
                            
print(now_im_too_tired[0:5])

print(now_im_too_tired[16:20])

print(now_im_too_tired[2:10])

print(now_im_too_tired[::-1])

print(now_im_too_tired[0:0:2])
