# Node REPL (Read–Eval–Print Loop) არის Node.js-ის ინტერაქტიული გარემო, სადაც შეგიძლია JavaScript კოდის დაწერა და მაშინვე გაშვება ტერმინალში.

# მოკლედ:
# REPL = სწრაფი “ცდა და ნახვა” Node.js-ში

# როგორ მუშაობს REPL?

# REPL შედგება 4 ნაბიჯისგან:

# 1. Read (წაკითხვა)

# Node იღებს შენს შეყვანილ კოდს (input).

# 2. Eval (გაშვება / შესრულება)

# კოდი სრულდება JavaScript engine-ის მიერ.

# 3. Print (გამოტანა)

# შედეგი ბრუნდება და ტერმინალში იბეჭდება.

# 4. Loop (გამეორება)

# პროცესი თავიდან იწყება — სანამ არ გამოხვალ.