''' შექმენით ცვლადი რომელშიც შეინახავთ მომხმარებლის ანგარიშის ემაილს, კომენმტარებით ახსენით თუ რატომ არ ვწერთ ამ ცვლადის სახელის სიტყვებს შეერთებულად და რა ქვია იმ მიდგომას რომელსაც თქვენ იყენებთ, ასევე დაწერეთ თქვენი სიტყვებით თუ რა არის ცვლადი და ჩამოწერეთ მისი შექმნის ნაბიჯები (3), საობლოოდ შექმენით ცვლადი number შემდეგ შეცვალეთ მისი მნიშვნელობა Number = 10-ით, საბოლოოდ კი NuMBEr = 20-ით და დაბეჭდეთ ეს მნიშვნელობა აღწერეთ რა შედეგი მიიღეთ და რატომ რას ნიშნავს python არის case senseitive'''


user_mail = "usermail222@mail.ru"
#ცვლადის სახელში თუ გვაქვს რამდენიმე სიტყვა მათ ვაშორებთ ქვედატირებით იმიტომ რომ ცვლადის სახელში არ შეიძლება სიტყვების დაშორება და ამას ქვია snake_case


number = 20
Number = 10
NuMBEr = 20
print(number)

#ეს კოდი დაბეჭდავს მხოლოდ number = 20ს  რადგან არ თუ გვსურს ცვლადის მნიშვნელობა შევცვალოთ არ უნდა დავწეროთ ცვლადის სახელი სხვანაირად 

#ტექსტურ მონაცემს ვწერთ ბრჭყალებში


#ინტეჯერი-მთელი რიცხვი
#სტრინგი-ტექსტური მონაცემი
#2 სტრინგის დამატებისას ხდება შეერთება პირველს ემატება მეორე ბოლოს, ამ მოვლენას ქვია კონკატინაცია
#2 ინტეჯერის დამატებისაას ისინი მათემატიკურად იკრიბებიან, ხდება ჯამი

#pay = "skas"
#pay = "2555"
#print(pay)
